mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xe/common/s6e1b3xe.h
/*******************************************************************************
* HDMICEC_MODULE
*******************************************************************************/
typedef struct stc_hdmicec_txctrl_field
{
        __IO   uint8_t  TXEN                     :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  START                    :1;
        __IO   uint8_t  EOM                      :1;
        __IO   uint8_t  ITSTEN                   :1;
        __IO   uint8_t  IBREN                    :1;
        __IO   uint8_t  RESERVED1                :2;
} stc_hdmicec_txctrl_field_t;

typedef struct stc_hdmicec_txdata_field
{
    union {
        struct {
            __IO   uint8_t  TXDATA               :8;
        };
        struct {
            __IO   uint8_t  TXDATA0              :1;
            __IO   uint8_t  TXDATA1              :1;
            __IO   uint8_t  TXDATA2              :1;
            __IO   uint8_t  TXDATA3              :1;
            __IO   uint8_t  TXDATA4              :1;
            __IO   uint8_t  TXDATA5              :1;
            __IO   uint8_t  TXDATA6              :1;
            __IO   uint8_t  TXDATA7              :1;
        };
    };
} stc_hdmicec_txdata_field_t;

typedef struct stc_hdmicec_txsts_field
{
        __IO   uint8_t  ACKSV                    :1;
        __IO   uint8_t  RESERVED0                :3;
        __IO   uint8_t  ITST                     :1;
        __IO   uint8_t  IBR                      :1;
        __IO   uint8_t  RESERVED1                :2;
} stc_hdmicec_txsts_field_t;

typedef struct stc_hdmicec_sfree_field
{
    union {
        struct {
            __IO   uint8_t  SFREE                :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  SFREE0               :1;
            __IO   uint8_t  SFREE1               :1;
            __IO   uint8_t  SFREE2               :1;
            __IO   uint8_t  SFREE3               :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_hdmicec_sfree_field_t;

typedef struct stc_hdmicec_rcst_field
{
        __IO   uint8_t  OVF                      :1;
        __IO   uint8_t  EOM                      :1;
        __IO   uint8_t  ACK                      :1;
        __IO   uint8_t  ST                       :1;
        __IO   uint8_t  OVFSEL                   :1;
        __IO   uint8_t  OVFIE                    :1;
        __IO   uint8_t  ACKIE                    :1;
        __IO   uint8_t  STIE                     :1;
} stc_hdmicec_rcst_field_t;

typedef struct stc_hdmicec_rccr_field
{
    union {
        struct {
            __IO   uint8_t  EN                   :1;
            __IO   uint8_t  MOD                  :2;
            __IO   uint8_t  ADRCE                :1;
            __IO   uint8_t  RESERVED1            :3;
            __IO   uint8_t  THSEL                :1;
        };
        struct {
            __IO   uint8_t  RESERVED0            :1;
            __IO   uint8_t  MOD0                 :1;
            __IO   uint8_t  MOD1                 :1;
            __IO   uint8_t  RESERVED2            :5;
        };
    };
} stc_hdmicec_rccr_field_t;

typedef struct stc_hdmicec_rcdahw_field
{
    union {
        struct {
            __IO   uint8_t  RCDAHW               :8;
        };
        struct {
            __IO   uint8_t  RCDAHW0              :1;
            __IO   uint8_t  RCDAHW1              :1;
            __IO   uint8_t  RCDAHW2              :1;
            __IO   uint8_t  RCDAHW3              :1;
            __IO   uint8_t  RCDAHW4              :1;
            __IO   uint8_t  RCDAHW5              :1;
            __IO   uint8_t  RCDAHW6              :1;
            __IO   uint8_t  RCDAHW7              :1;
        };
    };
} stc_hdmicec_rcdahw_field_t;

typedef struct stc_hdmicec_rcshw_field
{
    union {
        struct {
            __IO   uint8_t  RCSHW                :8;
        };
        struct {
            __IO   uint8_t  RCSHW0               :1;
            __IO   uint8_t  RCSHW1               :1;
            __IO   uint8_t  RCSHW2               :1;
            __IO   uint8_t  RCSHW3               :1;
            __IO   uint8_t  RCSHW4               :1;
            __IO   uint8_t  RCSHW5               :1;
            __IO   uint8_t  RCSHW6               :1;
            __IO   uint8_t  RCSHW7               :1;
        };
    };
} stc_hdmicec_rcshw_field_t;

typedef struct stc_hdmicec_rcdbhw_field
{
    union {
        struct {
            __IO   uint8_t  RCDBHW               :8;
        };
        struct {
            __IO   uint8_t  RCDBHW0              :1;
            __IO   uint8_t  RCDBHW1              :1;
            __IO   uint8_t  RCDBHW2              :1;
            __IO   uint8_t  RCDBHW3              :1;
            __IO   uint8_t  RCDBHW4              :1;
            __IO   uint8_t  RCDBHW5              :1;
            __IO   uint8_t  RCDBHW6              :1;
            __IO   uint8_t  RCDBHW7              :1;
        };
    };
} stc_hdmicec_rcdbhw_field_t;

typedef struct stc_hdmicec_rcadr2_field
{
    union {
        struct {
            __IO   uint8_t  RCADR2               :5;
            __IO   uint8_t  RESERVED0            :3;
        };
        struct {
            __IO   uint8_t  RCADR20              :1;
            __IO   uint8_t  RCADR21              :1;
            __IO   uint8_t  RCADR22              :1;
            __IO   uint8_t  RCADR23              :1;
            __IO   uint8_t  RCADR24              :1;
            __IO   uint8_t  RESERVED1            :3;
        };
    };
} stc_hdmicec_rcadr2_field_t;

typedef struct stc_hdmicec_rcadr1_field
{
    union {
        struct {
            __IO   uint8_t  RCADR1               :5;
            __IO   uint8_t  RESERVED0            :3;
        };
        struct {
            __IO   uint8_t  RCADR10              :1;
            __IO   uint8_t  RCADR11              :1;
            __IO   uint8_t  RCADR12              :1;
            __IO   uint8_t  RCADR13              :1;
            __IO   uint8_t  RCADR14              :1;
            __IO   uint8_t  RESERVED1            :3;
        };
    };
} stc_hdmicec_rcadr1_field_t;

typedef struct stc_hdmicec_rcdthl_field
{
    union {
        struct {
            __IO   uint8_t  RCDTHL               :8;
        };
        struct {
            __IO   uint8_t  RCDTHL0              :1;
            __IO   uint8_t  RCDTHL1              :1;
            __IO   uint8_t  RCDTHL2              :1;
            __IO   uint8_t  RCDTHL3              :1;
            __IO   uint8_t  RCDTHL4              :1;
            __IO   uint8_t  RCDTHL5              :1;
            __IO   uint8_t  RCDTHL6              :1;
            __IO   uint8_t  RCDTHL7              :1;
        };
    };
} stc_hdmicec_rcdthl_field_t;

typedef struct stc_hdmicec_rcdthh_field
{
    union {
        struct {
            __IO   uint8_t  RCDTHH               :8;
        };
        struct {
            __IO   uint8_t  RCDTHH0              :1;
            __IO   uint8_t  RCDTHH1              :1;
            __IO   uint8_t  RCDTHH2              :1;
            __IO   uint8_t  RCDTHH3              :1;
            __IO   uint8_t  RCDTHH4              :1;
            __IO   uint8_t  RCDTHH5              :1;
            __IO   uint8_t  RCDTHH6              :1;
            __IO   uint8_t  RCDTHH7              :1;
        };
    };
} stc_hdmicec_rcdthh_field_t;

typedef struct stc_hdmicec_rcdtll_field
{
    union {
        struct {
            __IO   uint8_t  RCDTLL               :8;
        };
        struct {
            __IO   uint8_t  RCDTLL0              :1;
            __IO   uint8_t  RCDTLL1              :1;
            __IO   uint8_t  RCDTLL2              :1;
            __IO   uint8_t  RCDTLL3              :1;
            __IO   uint8_t  RCDTLL4              :1;
            __IO   uint8_t  RCDTLL5              :1;
            __IO   uint8_t  RCDTLL6              :1;
            __IO   uint8_t  RCDTLL7              :1;
        };
    };
} stc_hdmicec_rcdtll_field_t;

