mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xe/common/s6e1b3xe.h
/*******************************************************************************
* CRC Registers CRC
*   Register Definition
*******************************************************************************/
#define FM_CRC_CRCCR                              *((volatile  uint8_t*)(0x40039000UL))
#define FM0P_CRC_CRCCR                            *((volatile  uint8_t*)(0x40039000UL))
#define FM_CRC_CRCINIT                            *((volatile uint32_t*)(0x40039004UL))
#define FM0P_CRC_CRCINIT                          *((volatile uint32_t*)(0x40039004UL))
#define FM_CRC_CRCIN                              *((volatile uint32_t*)(0x40039008UL))
#define FM0P_CRC_CRCIN                            *((volatile uint32_t*)(0x40039008UL))
#define FM_CRC_CRCR                               *((volatile uint32_t*)(0x4003900CUL))
#define FM0P_CRC_CRCR                             *((volatile uint32_t*)(0x4003900CUL))

/*******************************************************************************
* CRG Registers CRG
*   Register Definition
*******************************************************************************/
#define FM_CRG_SCM_CTL                            *((volatile uint32_t*)(0x40010000UL))
#define FM0P_CRG_SCM_CTL                          *((volatile uint32_t*)(0x40010000UL))
#define FM_CRG_SCM_STR                            *((volatile uint32_t*)(0x40010004UL))
#define FM0P_CRG_SCM_STR                          *((volatile uint32_t*)(0x40010004UL))
#define FM_CRG_STB_CTL                            *((volatile uint32_t*)(0x40010008UL))
#define FM0P_CRG_STB_CTL                          *((volatile uint32_t*)(0x40010008UL))
#define FM_CRG_RST_STR                            *((volatile uint32_t*)(0x4001000CUL))
#define FM0P_CRG_RST_STR                          *((volatile uint32_t*)(0x4001000CUL))
#define FM_CRG_BSC_PSR                            *((volatile uint32_t*)(0x40010010UL))
#define FM0P_CRG_BSC_PSR                          *((volatile uint32_t*)(0x40010010UL))
#define FM_CRG_APBC0_PSR                          *((volatile uint32_t*)(0x40010014UL))
#define FM0P_CRG_APBC0_PSR                        *((volatile uint32_t*)(0x40010014UL))
#define FM_CRG_APBC1_PSR                          *((volatile uint32_t*)(0x40010018UL))
#define FM0P_CRG_APBC1_PSR                        *((volatile uint32_t*)(0x40010018UL))
#define FM_CRG_SWC_PSR                            *((volatile uint32_t*)(0x40010020UL))
#define FM0P_CRG_SWC_PSR                          *((volatile uint32_t*)(0x40010020UL))
#define FM_CRG_CSW_TMR                            *((volatile uint32_t*)(0x40010030UL))
#define FM0P_CRG_CSW_TMR                          *((volatile uint32_t*)(0x40010030UL))
#define FM_CRG_PSW_TMR                            *((volatile uint32_t*)(0x40010034UL))
#define FM0P_CRG_PSW_TMR                          *((volatile uint32_t*)(0x40010034UL))
#define FM_CRG_PLL_CTL1                           *((volatile uint32_t*)(0x40010038UL))
#define FM0P_CRG_PLL_CTL1                         *((volatile uint32_t*)(0x40010038UL))
#define FM_CRG_PLL_CTL2                           *((volatile uint32_t*)(0x4001003CUL))
#define FM0P_CRG_PLL_CTL2                         *((volatile uint32_t*)(0x4001003CUL))
#define FM_CRG_CSV_CTL                            *((volatile uint32_t*)(0x40010040UL))
#define FM0P_CRG_CSV_CTL                          *((volatile uint32_t*)(0x40010040UL))
#define FM_CRG_CSV_STR                            *((volatile uint32_t*)(0x40010044UL))
#define FM0P_CRG_CSV_STR                          *((volatile uint32_t*)(0x40010044UL))
#define FM_CRG_FCSWH_CTL                          *((volatile uint32_t*)(0x40010048UL))
#define FM0P_CRG_FCSWH_CTL                        *((volatile uint32_t*)(0x40010048UL))
#define FM_CRG_FCSWL_CTL                          *((volatile uint32_t*)(0x4001004CUL))
#define FM0P_CRG_FCSWL_CTL                        *((volatile uint32_t*)(0x4001004CUL))
#define FM_CRG_FCSWD_CTL                          *((volatile uint32_t*)(0x40010050UL))
#define FM0P_CRG_FCSWD_CTL                        *((volatile uint32_t*)(0x40010050UL))
#define FM_CRG_DBWDT_CTL                          *((volatile uint32_t*)(0x40010054UL))
#define FM0P_CRG_DBWDT_CTL                        *((volatile uint32_t*)(0x40010054UL))
#define FM_CRG_INT_ENR                            *((volatile uint32_t*)(0x40010060UL))
#define FM0P_CRG_INT_ENR                          *((volatile uint32_t*)(0x40010060UL))
#define FM_CRG_INT_STR                            *((volatile uint32_t*)(0x40010064UL))
#define FM0P_CRG_INT_STR                          *((volatile uint32_t*)(0x40010064UL))
#define FM_CRG_INT_CLR                            *((volatile uint32_t*)(0x40010068UL))
#define FM0P_CRG_INT_CLR                          *((volatile uint32_t*)(0x40010068UL))

/*******************************************************************************
* CRTRIM Registers CRTRIM
*   Register Definition
*******************************************************************************/
#define FM_CRTRIM_MCR_PSR                         *((volatile  uint8_t*)(0x4002E000UL))
#define FM0P_CRTRIM_MCR_PSR                       *((volatile  uint8_t*)(0x4002E000UL))
#define FM_CRTRIM_MCR_FTRM                        *((volatile uint16_t*)(0x4002E004UL))
#define FM0P_CRTRIM_MCR_FTRM                      *((volatile uint16_t*)(0x4002E004UL))
#define FM_CRTRIM_MCR_TTRM                        *((volatile  uint8_t*)(0x4002E008UL))
#define FM0P_CRTRIM_MCR_TTRM                      *((volatile  uint8_t*)(0x4002E008UL))
#define FM_CRTRIM_MCR_RLR                         *((volatile uint32_t*)(0x4002E00CUL))
#define FM0P_CRTRIM_MCR_RLR                       *((volatile uint32_t*)(0x4002E00CUL))

/*******************************************************************************
* DS Registers DS
*   Register Definition
*******************************************************************************/
#define FM_DS_RCK_CTL                             *((volatile  uint8_t*)(0x40035104UL))
#define FM0P_DS_RCK_CTL                           *((volatile  uint8_t*)(0x40035104UL))
#define FM_DS_REG_CTL2                            *((volatile  uint8_t*)(0x40035108UL))
#define FM0P_DS_REG_CTL2                          *((volatile  uint8_t*)(0x40035108UL))
#define FM_DS_MOSC_CTL                            *((volatile  uint8_t*)(0x40035110UL))
#define FM0P_DS_MOSC_CTL                          *((volatile  uint8_t*)(0x40035110UL))
#define FM_DS_CAL_CTL                             *((volatile  uint8_t*)(0x40035200UL))
#define FM0P_DS_CAL_CTL                           *((volatile  uint8_t*)(0x40035200UL))
#define FM_DS_CAL_SET                             *((volatile  uint8_t*)(0x40035204UL))
#define FM0P_DS_CAL_SET                           *((volatile  uint8_t*)(0x40035204UL))
#define FM_DS_CAL_KEY                             *((volatile uint32_t*)(0x40035208UL))
#define FM0P_DS_CAL_KEY                           *((volatile uint32_t*)(0x40035208UL))
#define FM_DS_PMD_CTL                             *((volatile  uint8_t*)(0x40035800UL))
#define FM0P_DS_PMD_CTL                           *((volatile  uint8_t*)(0x40035800UL))
#define FM_DS_WRFSR                               *((volatile  uint8_t*)(0x40035804UL))
#define FM0P_DS_WRFSR                             *((volatile  uint8_t*)(0x40035804UL))
#define FM_DS_WIFSR                               *((volatile uint16_t*)(0x40035808UL))
#define FM0P_DS_WIFSR                             *((volatile uint16_t*)(0x40035808UL))
#define FM_DS_WIER                                *((volatile uint16_t*)(0x4003580CUL))
#define FM0P_DS_WIER                              *((volatile uint16_t*)(0x4003580CUL))
#define FM_DS_WILVR                               *((volatile uint16_t*)(0x40035810UL))
#define FM0P_DS_WILVR                             *((volatile uint16_t*)(0x40035810UL))
#define FM_DS_DSRAMR                              *((volatile  uint8_t*)(0x40035814UL))
#define FM0P_DS_DSRAMR                            *((volatile  uint8_t*)(0x40035814UL))
#define FM_DS_STBFLASHPDX                         *((volatile  uint8_t*)(0x40035820UL))
#define FM0P_DS_STBFLASHPDX                       *((volatile  uint8_t*)(0x40035820UL))
#define FM_DS_BUR01                               *((volatile  uint8_t*)(0x40035900UL))
#define FM0P_DS_BUR01                             *((volatile  uint8_t*)(0x40035900UL))
#define FM_DS_BUR02                               *((volatile  uint8_t*)(0x40035901UL))
#define FM0P_DS_BUR02                             *((volatile  uint8_t*)(0x40035901UL))
#define FM_DS_BUR03                               *((volatile  uint8_t*)(0x40035902UL))
#define FM0P_DS_BUR03                             *((volatile  uint8_t*)(0x40035902UL))
#define FM_DS_BUR04                               *((volatile  uint8_t*)(0x40035903UL))
#define FM0P_DS_BUR04                             *((volatile  uint8_t*)(0x40035903UL))
#define FM_DS_BUR05                               *((volatile  uint8_t*)(0x40035904UL))
#define FM0P_DS_BUR05                             *((volatile  uint8_t*)(0x40035904UL))
#define FM_DS_BUR06                               *((volatile  uint8_t*)(0x40035905UL))
#define FM0P_DS_BUR06                             *((volatile  uint8_t*)(0x40035905UL))
#define FM_DS_BUR07                               *((volatile  uint8_t*)(0x40035906UL))
#define FM0P_DS_BUR07                             *((volatile  uint8_t*)(0x40035906UL))
#define FM_DS_BUR08                               *((volatile  uint8_t*)(0x40035907UL))
#define FM0P_DS_BUR08                             *((volatile  uint8_t*)(0x40035907UL))
#define FM_DS_BUR09                               *((volatile  uint8_t*)(0x40035908UL))
#define FM0P_DS_BUR09                             *((volatile  uint8_t*)(0x40035908UL))
#define FM_DS_BUR10                               *((volatile  uint8_t*)(0x40035909UL))
#define FM0P_DS_BUR10                             *((volatile  uint8_t*)(0x40035909UL))
#define FM_DS_BUR11                               *((volatile  uint8_t*)(0x4003590AUL))
#define FM0P_DS_BUR11                             *((volatile  uint8_t*)(0x4003590AUL))
#define FM_DS_BUR12                               *((volatile  uint8_t*)(0x4003590BUL))
#define FM0P_DS_BUR12                             *((volatile  uint8_t*)(0x4003590BUL))
#define FM_DS_BUR13                               *((volatile  uint8_t*)(0x4003590CUL))
#define FM0P_DS_BUR13                             *((volatile  uint8_t*)(0x4003590CUL))
#define FM_DS_BUR14                               *((volatile  uint8_t*)(0x4003590DUL))
#define FM0P_DS_BUR14                             *((volatile  uint8_t*)(0x4003590DUL))
#define FM_DS_BUR15                               *((volatile  uint8_t*)(0x4003590EUL))
#define FM0P_DS_BUR15                             *((volatile  uint8_t*)(0x4003590EUL))
#define FM_DS_BUR16                               *((volatile  uint8_t*)(0x4003590FUL))
#define FM0P_DS_BUR16                             *((volatile  uint8_t*)(0x4003590FUL))

