mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xe/common/s6e1b3xe.h
#define bFM_FASTIO_FPDIR4_P4                      *((volatile  uint8_t *)(0xF8011040UL))
#define bFM0P_FASTIO_FPDIR4_P4                    *((volatile  uint8_t *)(0xF8011040UL))
#define bFM_FASTIO_FPDIR4_P5                      *((volatile  uint8_t *)(0xF8011080UL))
#define bFM0P_FASTIO_FPDIR4_P5                    *((volatile  uint8_t *)(0xF8011080UL))
#define bFM_FASTIO_FPDIR4_P6                      *((volatile  uint8_t *)(0xF8011100UL))
#define bFM0P_FASTIO_FPDIR4_P6                    *((volatile  uint8_t *)(0xF8011100UL))
#define bFM_FASTIO_FPDIR4_P7                      *((volatile  uint8_t *)(0xF8011200UL))
#define bFM0P_FASTIO_FPDIR4_P7                    *((volatile  uint8_t *)(0xF8011200UL))
#define bFM_FASTIO_FPDIR4_P8                      *((volatile  uint8_t *)(0xF8011005UL))
#define bFM0P_FASTIO_FPDIR4_P8                    *((volatile  uint8_t *)(0xF8011005UL))
#define bFM_FASTIO_FPDIR4_P9                      *((volatile  uint8_t *)(0xF8011009UL))
#define bFM0P_FASTIO_FPDIR4_P9                    *((volatile  uint8_t *)(0xF8011009UL))
#define bFM_FASTIO_FPDIR4_PA                      *((volatile  uint8_t *)(0xF8011011UL))
#define bFM0P_FASTIO_FPDIR4_PA                    *((volatile  uint8_t *)(0xF8011011UL))
#define bFM_FASTIO_FPDIR4_PB                      *((volatile  uint8_t *)(0xF8011021UL))
#define bFM0P_FASTIO_FPDIR4_PB                    *((volatile  uint8_t *)(0xF8011021UL))
#define bFM_FASTIO_FPDIR4_PC                      *((volatile  uint8_t *)(0xF8011041UL))
#define bFM0P_FASTIO_FPDIR4_PC                    *((volatile  uint8_t *)(0xF8011041UL))
#define bFM_FASTIO_FPDIR4_PD                      *((volatile  uint8_t *)(0xF8011081UL))
#define bFM0P_FASTIO_FPDIR4_PD                    *((volatile  uint8_t *)(0xF8011081UL))

#define bFM_FASTIO_FPDIR5_P0                      *((volatile  uint8_t *)(0xF8011404UL))
#define bFM0P_FASTIO_FPDIR5_P0                    *((volatile  uint8_t *)(0xF8011404UL))
#define bFM_FASTIO_FPDIR5_P1                      *((volatile  uint8_t *)(0xF8011408UL))
#define bFM0P_FASTIO_FPDIR5_P1                    *((volatile  uint8_t *)(0xF8011408UL))
#define bFM_FASTIO_FPDIR5_P2                      *((volatile  uint8_t *)(0xF8011410UL))
#define bFM0P_FASTIO_FPDIR5_P2                    *((volatile  uint8_t *)(0xF8011410UL))
#define bFM_FASTIO_FPDIR5_P3                      *((volatile  uint8_t *)(0xF8011420UL))
#define bFM0P_FASTIO_FPDIR5_P3                    *((volatile  uint8_t *)(0xF8011420UL))
#define bFM_FASTIO_FPDIR5_P4                      *((volatile  uint8_t *)(0xF8011440UL))
#define bFM0P_FASTIO_FPDIR5_P4                    *((volatile  uint8_t *)(0xF8011440UL))
#define bFM_FASTIO_FPDIR5_P5                      *((volatile  uint8_t *)(0xF8011480UL))
#define bFM0P_FASTIO_FPDIR5_P5                    *((volatile  uint8_t *)(0xF8011480UL))
#define bFM_FASTIO_FPDIR5_P6                      *((volatile  uint8_t *)(0xF8011500UL))
#define bFM0P_FASTIO_FPDIR5_P6                    *((volatile  uint8_t *)(0xF8011500UL))

#define bFM_FASTIO_FPDIR6_P0                      *((volatile  uint8_t *)(0xF8011804UL))
#define bFM0P_FASTIO_FPDIR6_P0                    *((volatile  uint8_t *)(0xF8011804UL))
#define bFM_FASTIO_FPDIR6_P1                      *((volatile  uint8_t *)(0xF8011808UL))
#define bFM0P_FASTIO_FPDIR6_P1                    *((volatile  uint8_t *)(0xF8011808UL))
#define bFM_FASTIO_FPDIR6_P2                      *((volatile  uint8_t *)(0xF8011810UL))
#define bFM0P_FASTIO_FPDIR6_P2                    *((volatile  uint8_t *)(0xF8011810UL))
#define bFM_FASTIO_FPDIR6_P3                      *((volatile  uint8_t *)(0xF8011820UL))
#define bFM0P_FASTIO_FPDIR6_P3                    *((volatile  uint8_t *)(0xF8011820UL))

#define bFM_FASTIO_FPDIR8_P0                      *((volatile  uint8_t *)(0xF8012004UL))
#define bFM0P_FASTIO_FPDIR8_P0                    *((volatile  uint8_t *)(0xF8012004UL))
#define bFM_FASTIO_FPDIR8_P1                      *((volatile  uint8_t *)(0xF8012008UL))
#define bFM0P_FASTIO_FPDIR8_P1                    *((volatile  uint8_t *)(0xF8012008UL))
#define bFM_FASTIO_FPDIR8_P2                      *((volatile  uint8_t *)(0xF8012010UL))
#define bFM0P_FASTIO_FPDIR8_P2                    *((volatile  uint8_t *)(0xF8012010UL))

#define bFM_FASTIO_FPDIRE_P0                      *((volatile  uint8_t *)(0xF8013804UL))
#define bFM0P_FASTIO_FPDIRE_P0                    *((volatile  uint8_t *)(0xF8013804UL))
#define bFM_FASTIO_FPDIRE_P2                      *((volatile  uint8_t *)(0xF8013810UL))
#define bFM0P_FASTIO_FPDIRE_P2                    *((volatile  uint8_t *)(0xF8013810UL))
#define bFM_FASTIO_FPDIRE_P3                      *((volatile  uint8_t *)(0xF8013820UL))
#define bFM0P_FASTIO_FPDIRE_P3                    *((volatile  uint8_t *)(0xF8013820UL))

#define bFM_FASTIO_FPDOR0_P0                      *((volatile  uint8_t *)(0xF8014004UL))
#define bFM0P_FASTIO_FPDOR0_P0                    *((volatile  uint8_t *)(0xF8014004UL))
#define bFM_FASTIO_FPDOR0_P1                      *((volatile  uint8_t *)(0xF8014008UL))
#define bFM0P_FASTIO_FPDOR0_P1                    *((volatile  uint8_t *)(0xF8014008UL))
#define bFM_FASTIO_FPDOR0_P2                      *((volatile  uint8_t *)(0xF8014010UL))
#define bFM0P_FASTIO_FPDOR0_P2                    *((volatile  uint8_t *)(0xF8014010UL))
#define bFM_FASTIO_FPDOR0_P3                      *((volatile  uint8_t *)(0xF8014020UL))
#define bFM0P_FASTIO_FPDOR0_P3                    *((volatile  uint8_t *)(0xF8014020UL))
#define bFM_FASTIO_FPDOR0_P4                      *((volatile  uint8_t *)(0xF8014040UL))
#define bFM0P_FASTIO_FPDOR0_P4                    *((volatile  uint8_t *)(0xF8014040UL))
#define bFM_FASTIO_FPDOR0_P7                      *((volatile  uint8_t *)(0xF8014200UL))
#define bFM0P_FASTIO_FPDOR0_P7                    *((volatile  uint8_t *)(0xF8014200UL))
#define bFM_FASTIO_FPDOR0_PA                      *((volatile  uint8_t *)(0xF8014011UL))
#define bFM0P_FASTIO_FPDOR0_PA                    *((volatile  uint8_t *)(0xF8014011UL))
#define bFM_FASTIO_FPDOR0_PB                      *((volatile  uint8_t *)(0xF8014021UL))
#define bFM0P_FASTIO_FPDOR0_PB                    *((volatile  uint8_t *)(0xF8014021UL))
#define bFM_FASTIO_FPDOR0_PC                      *((volatile  uint8_t *)(0xF8014041UL))
#define bFM0P_FASTIO_FPDOR0_PC                    *((volatile  uint8_t *)(0xF8014041UL))
#define bFM_FASTIO_FPDOR0_PD                      *((volatile  uint8_t *)(0xF8014081UL))
#define bFM0P_FASTIO_FPDOR0_PD                    *((volatile  uint8_t *)(0xF8014081UL))
#define bFM_FASTIO_FPDOR0_PE                      *((volatile  uint8_t *)(0xF8014101UL))
#define bFM0P_FASTIO_FPDOR0_PE                    *((volatile  uint8_t *)(0xF8014101UL))
#define bFM_FASTIO_FPDOR0_PF                      *((volatile  uint8_t *)(0xF8014201UL))
#define bFM0P_FASTIO_FPDOR0_PF                    *((volatile  uint8_t *)(0xF8014201UL))

#define bFM_FASTIO_FPDOR1_P0                      *((volatile  uint8_t *)(0xF8014404UL))
#define bFM0P_FASTIO_FPDOR1_P0                    *((volatile  uint8_t *)(0xF8014404UL))
#define bFM_FASTIO_FPDOR1_P1                      *((volatile  uint8_t *)(0xF8014408UL))
#define bFM0P_FASTIO_FPDOR1_P1                    *((volatile  uint8_t *)(0xF8014408UL))
#define bFM_FASTIO_FPDOR1_P2                      *((volatile  uint8_t *)(0xF8014410UL))
#define bFM0P_FASTIO_FPDOR1_P2                    *((volatile  uint8_t *)(0xF8014410UL))
#define bFM_FASTIO_FPDOR1_P3                      *((volatile  uint8_t *)(0xF8014420UL))
#define bFM0P_FASTIO_FPDOR1_P3                    *((volatile  uint8_t *)(0xF8014420UL))
#define bFM_FASTIO_FPDOR1_P4                      *((volatile  uint8_t *)(0xF8014440UL))
#define bFM0P_FASTIO_FPDOR1_P4                    *((volatile  uint8_t *)(0xF8014440UL))
#define bFM_FASTIO_FPDOR1_P5                      *((volatile  uint8_t *)(0xF8014480UL))
#define bFM0P_FASTIO_FPDOR1_P5                    *((volatile  uint8_t *)(0xF8014480UL))
#define bFM_FASTIO_FPDOR1_P6                      *((volatile  uint8_t *)(0xF8014500UL))
#define bFM0P_FASTIO_FPDOR1_P6                    *((volatile  uint8_t *)(0xF8014500UL))
#define bFM_FASTIO_FPDOR1_P7                      *((volatile  uint8_t *)(0xF8014600UL))
#define bFM0P_FASTIO_FPDOR1_P7                    *((volatile  uint8_t *)(0xF8014600UL))
#define bFM_FASTIO_FPDOR1_P8                      *((volatile  uint8_t *)(0xF8014405UL))
#define bFM0P_FASTIO_FPDOR1_P8                    *((volatile  uint8_t *)(0xF8014405UL))
#define bFM_FASTIO_FPDOR1_P9                      *((volatile  uint8_t *)(0xF8014409UL))
#define bFM0P_FASTIO_FPDOR1_P9                    *((volatile  uint8_t *)(0xF8014409UL))
#define bFM_FASTIO_FPDOR1_PA                      *((volatile  uint8_t *)(0xF8014411UL))
#define bFM0P_FASTIO_FPDOR1_PA                    *((volatile  uint8_t *)(0xF8014411UL))
#define bFM_FASTIO_FPDOR1_PB                      *((volatile  uint8_t *)(0xF8014421UL))
#define bFM0P_FASTIO_FPDOR1_PB                    *((volatile  uint8_t *)(0xF8014421UL))

#define bFM_FASTIO_FPDOR2_P1                      *((volatile  uint8_t *)(0xF8014808UL))
#define bFM0P_FASTIO_FPDOR2_P1                    *((volatile  uint8_t *)(0xF8014808UL))
#define bFM_FASTIO_FPDOR2_P2                      *((volatile  uint8_t *)(0xF8014810UL))
#define bFM0P_FASTIO_FPDOR2_P2                    *((volatile  uint8_t *)(0xF8014810UL))
#define bFM_FASTIO_FPDOR2_P3                      *((volatile  uint8_t *)(0xF8014820UL))
#define bFM0P_FASTIO_FPDOR2_P3                    *((volatile  uint8_t *)(0xF8014820UL))

#define bFM_FASTIO_FPDOR3_P0                      *((volatile  uint8_t *)(0xF8014C04UL))
#define bFM0P_FASTIO_FPDOR3_P0                    *((volatile  uint8_t *)(0xF8014C04UL))
#define bFM_FASTIO_FPDOR3_P1                      *((volatile  uint8_t *)(0xF8014C08UL))
#define bFM0P_FASTIO_FPDOR3_P1                    *((volatile  uint8_t *)(0xF8014C08UL))
#define bFM_FASTIO_FPDOR3_P2                      *((volatile  uint8_t *)(0xF8014C10UL))
#define bFM0P_FASTIO_FPDOR3_P2                    *((volatile  uint8_t *)(0xF8014C10UL))
#define bFM_FASTIO_FPDOR3_P3                      *((volatile  uint8_t *)(0xF8014C20UL))
#define bFM0P_FASTIO_FPDOR3_P3                    *((volatile  uint8_t *)(0xF8014C20UL))
#define bFM_FASTIO_FPDOR3_P9                      *((volatile  uint8_t *)(0xF8014C09UL))
#define bFM0P_FASTIO_FPDOR3_P9                    *((volatile  uint8_t *)(0xF8014C09UL))
#define bFM_FASTIO_FPDOR3_PA                      *((volatile  uint8_t *)(0xF8014C11UL))
#define bFM0P_FASTIO_FPDOR3_PA                    *((volatile  uint8_t *)(0xF8014C11UL))
#define bFM_FASTIO_FPDOR3_PB                      *((volatile  uint8_t *)(0xF8014C21UL))
#define bFM0P_FASTIO_FPDOR3_PB                    *((volatile  uint8_t *)(0xF8014C21UL))
#define bFM_FASTIO_FPDOR3_PC                      *((volatile  uint8_t *)(0xF8014C41UL))
#define bFM0P_FASTIO_FPDOR3_PC                    *((volatile  uint8_t *)(0xF8014C41UL))
#define bFM_FASTIO_FPDOR3_PD                      *((volatile  uint8_t *)(0xF8014C81UL))
#define bFM0P_FASTIO_FPDOR3_PD                    *((volatile  uint8_t *)(0xF8014C81UL))
#define bFM_FASTIO_FPDOR3_PE                      *((volatile  uint8_t *)(0xF8014D01UL))
#define bFM0P_FASTIO_FPDOR3_PE                    *((volatile  uint8_t *)(0xF8014D01UL))
#define bFM_FASTIO_FPDOR3_PF                      *((volatile  uint8_t *)(0xF8014E01UL))
#define bFM0P_FASTIO_FPDOR3_PF                    *((volatile  uint8_t *)(0xF8014E01UL))

#define bFM_FASTIO_FPDOR4_P4                      *((volatile  uint8_t *)(0xF8015040UL))
#define bFM0P_FASTIO_FPDOR4_P4                    *((volatile  uint8_t *)(0xF8015040UL))
#define bFM_FASTIO_FPDOR4_P5                      *((volatile  uint8_t *)(0xF8015080UL))
#define bFM0P_FASTIO_FPDOR4_P5                    *((volatile  uint8_t *)(0xF8015080UL))
#define bFM_FASTIO_FPDOR4_P6                      *((volatile  uint8_t *)(0xF8015100UL))
#define bFM0P_FASTIO_FPDOR4_P6                    *((volatile  uint8_t *)(0xF8015100UL))
#define bFM_FASTIO_FPDOR4_P7                      *((volatile  uint8_t *)(0xF8015200UL))
#define bFM0P_FASTIO_FPDOR4_P7                    *((volatile  uint8_t *)(0xF8015200UL))
#define bFM_FASTIO_FPDOR4_P8                      *((volatile  uint8_t *)(0xF8015005UL))
#define bFM0P_FASTIO_FPDOR4_P8                    *((volatile  uint8_t *)(0xF8015005UL))
#define bFM_FASTIO_FPDOR4_P9                      *((volatile  uint8_t *)(0xF8015009UL))
#define bFM0P_FASTIO_FPDOR4_P9                    *((volatile  uint8_t *)(0xF8015009UL))
#define bFM_FASTIO_FPDOR4_PA                      *((volatile  uint8_t *)(0xF8015011UL))
#define bFM0P_FASTIO_FPDOR4_PA                    *((volatile  uint8_t *)(0xF8015011UL))
#define bFM_FASTIO_FPDOR4_PB                      *((volatile  uint8_t *)(0xF8015021UL))
#define bFM0P_FASTIO_FPDOR4_PB                    *((volatile  uint8_t *)(0xF8015021UL))
#define bFM_FASTIO_FPDOR4_PC                      *((volatile  uint8_t *)(0xF8015041UL))
#define bFM0P_FASTIO_FPDOR4_PC                    *((volatile  uint8_t *)(0xF8015041UL))
#define bFM_FASTIO_FPDOR4_PD                      *((volatile  uint8_t *)(0xF8015081UL))
#define bFM0P_FASTIO_FPDOR4_PD                    *((volatile  uint8_t *)(0xF8015081UL))

