mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xe/common/s6e1b3xe.h
#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42664400UL))
#define bFM0P_GPIO_DDR8_P0                        *((volatile  uint8_t *)(0x42664400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42664404UL))
#define bFM0P_GPIO_DDR8_P1                        *((volatile  uint8_t *)(0x42664404UL))
#define bFM_GPIO_DDR8_P2                          *((volatile  uint8_t *)(0x42664408UL))
#define bFM0P_GPIO_DDR8_P2                        *((volatile  uint8_t *)(0x42664408UL))

#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42664700UL))
#define bFM0P_GPIO_DDRE_P0                        *((volatile  uint8_t *)(0x42664700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42664708UL))
#define bFM0P_GPIO_DDRE_P2                        *((volatile  uint8_t *)(0x42664708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x4266470CUL))
#define bFM0P_GPIO_DDRE_P3                        *((volatile  uint8_t *)(0x4266470CUL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile  uint8_t *)(0x4266C000UL))
#define bFM0P_GPIO_EPFR00_NMIS                    *((volatile  uint8_t *)(0x4266C000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile  uint8_t *)(0x4266C024UL))
#define bFM0P_GPIO_EPFR00_USBP0E                  *((volatile  uint8_t *)(0x4266C024UL))
#define bFM_GPIO_EPFR00_SWDEN                     *((volatile  uint8_t *)(0x4266C040UL))
#define bFM0P_GPIO_EPFR00_SWDEN                   *((volatile  uint8_t *)(0x4266C040UL))

#define bFM_GPIO_EPFR01_DTTI0C                    *((volatile  uint8_t *)(0x4266C0B0UL))
#define bFM0P_GPIO_EPFR01_DTTI0C                  *((volatile  uint8_t *)(0x4266C0B0UL))
#define bFM_GPIO_EPFR01_IGTRG0                    *((volatile  uint8_t *)(0x4266C0B4UL))
#define bFM0P_GPIO_EPFR01_IGTRG0                  *((volatile  uint8_t *)(0x4266C0B4UL))

#define bFM_GPIO_FPOER0_P0                        *((volatile  uint8_t *)(0x42672000UL))
#define bFM0P_GPIO_FPOER0_P0                      *((volatile  uint8_t *)(0x42672000UL))
#define bFM_GPIO_FPOER0_P1                        *((volatile  uint8_t *)(0x42672004UL))
#define bFM0P_GPIO_FPOER0_P1                      *((volatile  uint8_t *)(0x42672004UL))
#define bFM_GPIO_FPOER0_P2                        *((volatile  uint8_t *)(0x42672008UL))
#define bFM0P_GPIO_FPOER0_P2                      *((volatile  uint8_t *)(0x42672008UL))
#define bFM_GPIO_FPOER0_P3                        *((volatile  uint8_t *)(0x4267200CUL))
#define bFM0P_GPIO_FPOER0_P3                      *((volatile  uint8_t *)(0x4267200CUL))
#define bFM_GPIO_FPOER0_P4                        *((volatile  uint8_t *)(0x42672010UL))
#define bFM0P_GPIO_FPOER0_P4                      *((volatile  uint8_t *)(0x42672010UL))
#define bFM_GPIO_FPOER0_P7                        *((volatile  uint8_t *)(0x4267201CUL))
#define bFM0P_GPIO_FPOER0_P7                      *((volatile  uint8_t *)(0x4267201CUL))
#define bFM_GPIO_FPOER0_PA                        *((volatile  uint8_t *)(0x42672028UL))
#define bFM0P_GPIO_FPOER0_PA                      *((volatile  uint8_t *)(0x42672028UL))
#define bFM_GPIO_FPOER0_PB                        *((volatile  uint8_t *)(0x4267202CUL))
#define bFM0P_GPIO_FPOER0_PB                      *((volatile  uint8_t *)(0x4267202CUL))
#define bFM_GPIO_FPOER0_PC                        *((volatile  uint8_t *)(0x42672030UL))
#define bFM0P_GPIO_FPOER0_PC                      *((volatile  uint8_t *)(0x42672030UL))
#define bFM_GPIO_FPOER0_PD                        *((volatile  uint8_t *)(0x42672034UL))
#define bFM0P_GPIO_FPOER0_PD                      *((volatile  uint8_t *)(0x42672034UL))
#define bFM_GPIO_FPOER0_PE                        *((volatile  uint8_t *)(0x42672038UL))
#define bFM0P_GPIO_FPOER0_PE                      *((volatile  uint8_t *)(0x42672038UL))
#define bFM_GPIO_FPOER0_PF                        *((volatile  uint8_t *)(0x4267203CUL))
#define bFM0P_GPIO_FPOER0_PF                      *((volatile  uint8_t *)(0x4267203CUL))

#define bFM_GPIO_FPOER1_P0                        *((volatile  uint8_t *)(0x42672080UL))
#define bFM0P_GPIO_FPOER1_P0                      *((volatile  uint8_t *)(0x42672080UL))
#define bFM_GPIO_FPOER1_P1                        *((volatile  uint8_t *)(0x42672084UL))
#define bFM0P_GPIO_FPOER1_P1                      *((volatile  uint8_t *)(0x42672084UL))
#define bFM_GPIO_FPOER1_P2                        *((volatile  uint8_t *)(0x42672088UL))
#define bFM0P_GPIO_FPOER1_P2                      *((volatile  uint8_t *)(0x42672088UL))
#define bFM_GPIO_FPOER1_P3                        *((volatile  uint8_t *)(0x4267208CUL))
#define bFM0P_GPIO_FPOER1_P3                      *((volatile  uint8_t *)(0x4267208CUL))
#define bFM_GPIO_FPOER1_P4                        *((volatile  uint8_t *)(0x42672090UL))
#define bFM0P_GPIO_FPOER1_P4                      *((volatile  uint8_t *)(0x42672090UL))
#define bFM_GPIO_FPOER1_P5                        *((volatile  uint8_t *)(0x42672094UL))
#define bFM0P_GPIO_FPOER1_P5                      *((volatile  uint8_t *)(0x42672094UL))
#define bFM_GPIO_FPOER1_P6                        *((volatile  uint8_t *)(0x42672098UL))
#define bFM0P_GPIO_FPOER1_P6                      *((volatile  uint8_t *)(0x42672098UL))
#define bFM_GPIO_FPOER1_P7                        *((volatile  uint8_t *)(0x4267209CUL))
#define bFM0P_GPIO_FPOER1_P7                      *((volatile  uint8_t *)(0x4267209CUL))
#define bFM_GPIO_FPOER1_P8                        *((volatile  uint8_t *)(0x426720A0UL))
#define bFM0P_GPIO_FPOER1_P8                      *((volatile  uint8_t *)(0x426720A0UL))
#define bFM_GPIO_FPOER1_P9                        *((volatile  uint8_t *)(0x426720A4UL))
#define bFM0P_GPIO_FPOER1_P9                      *((volatile  uint8_t *)(0x426720A4UL))
#define bFM_GPIO_FPOER1_PA                        *((volatile  uint8_t *)(0x426720A8UL))
#define bFM0P_GPIO_FPOER1_PA                      *((volatile  uint8_t *)(0x426720A8UL))
#define bFM_GPIO_FPOER1_PB                        *((volatile  uint8_t *)(0x426720ACUL))
#define bFM0P_GPIO_FPOER1_PB                      *((volatile  uint8_t *)(0x426720ACUL))

#define bFM_GPIO_FPOER2_P1                        *((volatile  uint8_t *)(0x42672104UL))
#define bFM0P_GPIO_FPOER2_P1                      *((volatile  uint8_t *)(0x42672104UL))
#define bFM_GPIO_FPOER2_P2                        *((volatile  uint8_t *)(0x42672108UL))
#define bFM0P_GPIO_FPOER2_P2                      *((volatile  uint8_t *)(0x42672108UL))
#define bFM_GPIO_FPOER2_P3                        *((volatile  uint8_t *)(0x4267210CUL))
#define bFM0P_GPIO_FPOER2_P3                      *((volatile  uint8_t *)(0x4267210CUL))

#define bFM_GPIO_FPOER3_P0                        *((volatile  uint8_t *)(0x42672180UL))
#define bFM0P_GPIO_FPOER3_P0                      *((volatile  uint8_t *)(0x42672180UL))
#define bFM_GPIO_FPOER3_P1                        *((volatile  uint8_t *)(0x42672184UL))
#define bFM0P_GPIO_FPOER3_P1                      *((volatile  uint8_t *)(0x42672184UL))
#define bFM_GPIO_FPOER3_P2                        *((volatile  uint8_t *)(0x42672188UL))
#define bFM0P_GPIO_FPOER3_P2                      *((volatile  uint8_t *)(0x42672188UL))
#define bFM_GPIO_FPOER3_P3                        *((volatile  uint8_t *)(0x4267218CUL))
#define bFM0P_GPIO_FPOER3_P3                      *((volatile  uint8_t *)(0x4267218CUL))
#define bFM_GPIO_FPOER3_P9                        *((volatile  uint8_t *)(0x426721A4UL))
#define bFM0P_GPIO_FPOER3_P9                      *((volatile  uint8_t *)(0x426721A4UL))
#define bFM_GPIO_FPOER3_PA                        *((volatile  uint8_t *)(0x426721A8UL))
#define bFM0P_GPIO_FPOER3_PA                      *((volatile  uint8_t *)(0x426721A8UL))
#define bFM_GPIO_FPOER3_PB                        *((volatile  uint8_t *)(0x426721ACUL))
#define bFM0P_GPIO_FPOER3_PB                      *((volatile  uint8_t *)(0x426721ACUL))
#define bFM_GPIO_FPOER3_PC                        *((volatile  uint8_t *)(0x426721B0UL))
#define bFM0P_GPIO_FPOER3_PC                      *((volatile  uint8_t *)(0x426721B0UL))
#define bFM_GPIO_FPOER3_PD                        *((volatile  uint8_t *)(0x426721B4UL))
#define bFM0P_GPIO_FPOER3_PD                      *((volatile  uint8_t *)(0x426721B4UL))
#define bFM_GPIO_FPOER3_PE                        *((volatile  uint8_t *)(0x426721B8UL))
#define bFM0P_GPIO_FPOER3_PE                      *((volatile  uint8_t *)(0x426721B8UL))
#define bFM_GPIO_FPOER3_PF                        *((volatile  uint8_t *)(0x426721BCUL))
#define bFM0P_GPIO_FPOER3_PF                      *((volatile  uint8_t *)(0x426721BCUL))

#define bFM_GPIO_FPOER4_P4                        *((volatile  uint8_t *)(0x42672210UL))
#define bFM0P_GPIO_FPOER4_P4                      *((volatile  uint8_t *)(0x42672210UL))
#define bFM_GPIO_FPOER4_P5                        *((volatile  uint8_t *)(0x42672214UL))
#define bFM0P_GPIO_FPOER4_P5                      *((volatile  uint8_t *)(0x42672214UL))
#define bFM_GPIO_FPOER4_P6                        *((volatile  uint8_t *)(0x42672218UL))
#define bFM0P_GPIO_FPOER4_P6                      *((volatile  uint8_t *)(0x42672218UL))
#define bFM_GPIO_FPOER4_P7                        *((volatile  uint8_t *)(0x4267221CUL))
#define bFM0P_GPIO_FPOER4_P7                      *((volatile  uint8_t *)(0x4267221CUL))
#define bFM_GPIO_FPOER4_P8                        *((volatile  uint8_t *)(0x42672220UL))
#define bFM0P_GPIO_FPOER4_P8                      *((volatile  uint8_t *)(0x42672220UL))
#define bFM_GPIO_FPOER4_P9                        *((volatile  uint8_t *)(0x42672224UL))
#define bFM0P_GPIO_FPOER4_P9                      *((volatile  uint8_t *)(0x42672224UL))
#define bFM_GPIO_FPOER4_PA                        *((volatile  uint8_t *)(0x42672228UL))
#define bFM0P_GPIO_FPOER4_PA                      *((volatile  uint8_t *)(0x42672228UL))
#define bFM_GPIO_FPOER4_PB                        *((volatile  uint8_t *)(0x4267222CUL))
#define bFM0P_GPIO_FPOER4_PB                      *((volatile  uint8_t *)(0x4267222CUL))
#define bFM_GPIO_FPOER4_PC                        *((volatile  uint8_t *)(0x42672230UL))
#define bFM0P_GPIO_FPOER4_PC                      *((volatile  uint8_t *)(0x42672230UL))
#define bFM_GPIO_FPOER4_PD                        *((volatile  uint8_t *)(0x42672234UL))
#define bFM0P_GPIO_FPOER4_PD                      *((volatile  uint8_t *)(0x42672234UL))

#define bFM_GPIO_FPOER5_P0                        *((volatile  uint8_t *)(0x42672280UL))
#define bFM0P_GPIO_FPOER5_P0                      *((volatile  uint8_t *)(0x42672280UL))
#define bFM_GPIO_FPOER5_P1                        *((volatile  uint8_t *)(0x42672284UL))
#define bFM0P_GPIO_FPOER5_P1                      *((volatile  uint8_t *)(0x42672284UL))
#define bFM_GPIO_FPOER5_P2                        *((volatile  uint8_t *)(0x42672288UL))
#define bFM0P_GPIO_FPOER5_P2                      *((volatile  uint8_t *)(0x42672288UL))
#define bFM_GPIO_FPOER5_P3                        *((volatile  uint8_t *)(0x4267228CUL))
#define bFM0P_GPIO_FPOER5_P3                      *((volatile  uint8_t *)(0x4267228CUL))
#define bFM_GPIO_FPOER5_P4                        *((volatile  uint8_t *)(0x42672290UL))
#define bFM0P_GPIO_FPOER5_P4                      *((volatile  uint8_t *)(0x42672290UL))
#define bFM_GPIO_FPOER5_P5                        *((volatile  uint8_t *)(0x42672294UL))
#define bFM0P_GPIO_FPOER5_P5                      *((volatile  uint8_t *)(0x42672294UL))
#define bFM_GPIO_FPOER5_P6                        *((volatile  uint8_t *)(0x42672298UL))
#define bFM0P_GPIO_FPOER5_P6                      *((volatile  uint8_t *)(0x42672298UL))

#define bFM_GPIO_FPOER6_P0                        *((volatile  uint8_t *)(0x42672300UL))
#define bFM0P_GPIO_FPOER6_P0                      *((volatile  uint8_t *)(0x42672300UL))
#define bFM_GPIO_FPOER6_P1                        *((volatile  uint8_t *)(0x42672304UL))
#define bFM0P_GPIO_FPOER6_P1                      *((volatile  uint8_t *)(0x42672304UL))
#define bFM_GPIO_FPOER6_P2                        *((volatile  uint8_t *)(0x42672308UL))
#define bFM0P_GPIO_FPOER6_P2                      *((volatile  uint8_t *)(0x42672308UL))
#define bFM_GPIO_FPOER6_P3                        *((volatile  uint8_t *)(0x4267230CUL))
#define bFM0P_GPIO_FPOER6_P3                      *((volatile  uint8_t *)(0x4267230CUL))

#define bFM_GPIO_FPOER8_P0                        *((volatile  uint8_t *)(0x42672400UL))
#define bFM0P_GPIO_FPOER8_P0                      *((volatile  uint8_t *)(0x42672400UL))
#define bFM_GPIO_FPOER8_P1                        *((volatile  uint8_t *)(0x42672404UL))
#define bFM0P_GPIO_FPOER8_P1                      *((volatile  uint8_t *)(0x42672404UL))
#define bFM_GPIO_FPOER8_P2                        *((volatile  uint8_t *)(0x42672408UL))
#define bFM0P_GPIO_FPOER8_P2                      *((volatile  uint8_t *)(0x42672408UL))

