mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xe/common/s6e1b3xe.h
#define bFM_GPIO_PFR4_P4                          *((volatile  uint16_t*)(0x42660210UL))
#define bFM0P_GPIO_PFR4_P4                        *((volatile  uint16_t*)(0x42660210UL))
#define bFM_GPIO_PFR4_P5                          *((volatile  uint16_t*)(0x42660214UL))
#define bFM0P_GPIO_PFR4_P5                        *((volatile  uint16_t*)(0x42660214UL))
#define bFM_GPIO_PFR4_P6                          *((volatile  uint16_t*)(0x42660218UL))
#define bFM0P_GPIO_PFR4_P6                        *((volatile  uint16_t*)(0x42660218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile  uint16_t*)(0x4266021CUL))
#define bFM0P_GPIO_PFR4_P7                        *((volatile  uint16_t*)(0x4266021CUL))
#define bFM_GPIO_PFR4_P8                          *((volatile  uint16_t*)(0x42660220UL))
#define bFM0P_GPIO_PFR4_P8                        *((volatile  uint16_t*)(0x42660220UL))
#define bFM_GPIO_PFR4_P9                          *((volatile  uint16_t*)(0x42660224UL))
#define bFM0P_GPIO_PFR4_P9                        *((volatile  uint16_t*)(0x42660224UL))
#define bFM_GPIO_PFR4_PA                          *((volatile  uint16_t*)(0x42660228UL))
#define bFM0P_GPIO_PFR4_PA                        *((volatile  uint16_t*)(0x42660228UL))
#define bFM_GPIO_PFR4_PB                          *((volatile  uint16_t*)(0x4266022CUL))
#define bFM0P_GPIO_PFR4_PB                        *((volatile  uint16_t*)(0x4266022CUL))
#define bFM_GPIO_PFR4_PC                          *((volatile  uint16_t*)(0x42660230UL))
#define bFM0P_GPIO_PFR4_PC                        *((volatile  uint16_t*)(0x42660230UL))
#define bFM_GPIO_PFR4_PD                          *((volatile  uint16_t*)(0x42660234UL))
#define bFM0P_GPIO_PFR4_PD                        *((volatile  uint16_t*)(0x42660234UL))

#define bFM_GPIO_PFR5_P0                          *((volatile  uint8_t *)(0x42660280UL))
#define bFM0P_GPIO_PFR5_P0                        *((volatile  uint8_t *)(0x42660280UL))
#define bFM_GPIO_PFR5_P1                          *((volatile  uint8_t *)(0x42660284UL))
#define bFM0P_GPIO_PFR5_P1                        *((volatile  uint8_t *)(0x42660284UL))
#define bFM_GPIO_PFR5_P2                          *((volatile  uint8_t *)(0x42660288UL))
#define bFM0P_GPIO_PFR5_P2                        *((volatile  uint8_t *)(0x42660288UL))
#define bFM_GPIO_PFR5_P3                          *((volatile  uint8_t *)(0x4266028CUL))
#define bFM0P_GPIO_PFR5_P3                        *((volatile  uint8_t *)(0x4266028CUL))
#define bFM_GPIO_PFR5_P4                          *((volatile  uint8_t *)(0x42660290UL))
#define bFM0P_GPIO_PFR5_P4                        *((volatile  uint8_t *)(0x42660290UL))
#define bFM_GPIO_PFR5_P5                          *((volatile  uint8_t *)(0x42660294UL))
#define bFM0P_GPIO_PFR5_P5                        *((volatile  uint8_t *)(0x42660294UL))
#define bFM_GPIO_PFR5_P6                          *((volatile  uint8_t *)(0x42660298UL))
#define bFM0P_GPIO_PFR5_P6                        *((volatile  uint8_t *)(0x42660298UL))

#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42660300UL))
#define bFM0P_GPIO_PFR6_P0                        *((volatile  uint8_t *)(0x42660300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42660304UL))
#define bFM0P_GPIO_PFR6_P1                        *((volatile  uint8_t *)(0x42660304UL))
#define bFM_GPIO_PFR6_P2                          *((volatile  uint8_t *)(0x42660308UL))
#define bFM0P_GPIO_PFR6_P2                        *((volatile  uint8_t *)(0x42660308UL))
#define bFM_GPIO_PFR6_P3                          *((volatile  uint8_t *)(0x4266030CUL))
#define bFM0P_GPIO_PFR6_P3                        *((volatile  uint8_t *)(0x4266030CUL))

#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42660400UL))
#define bFM0P_GPIO_PFR8_P0                        *((volatile  uint8_t *)(0x42660400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42660404UL))
#define bFM0P_GPIO_PFR8_P1                        *((volatile  uint8_t *)(0x42660404UL))
#define bFM_GPIO_PFR8_P2                          *((volatile  uint8_t *)(0x42660408UL))
#define bFM0P_GPIO_PFR8_P2                        *((volatile  uint8_t *)(0x42660408UL))

#define bFM_GPIO_PFRE_P0                          *((volatile  uint8_t *)(0x42660700UL))
#define bFM0P_GPIO_PFRE_P0                        *((volatile  uint8_t *)(0x42660700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42660708UL))
#define bFM0P_GPIO_PFRE_P2                        *((volatile  uint8_t *)(0x42660708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x4266070CUL))
#define bFM0P_GPIO_PFRE_P3                        *((volatile  uint8_t *)(0x4266070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x4266E000UL))
#define bFM0P_GPIO_PZR0_P0                        *((volatile  uint8_t *)(0x4266E000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x4266E004UL))
#define bFM0P_GPIO_PZR0_P1                        *((volatile  uint8_t *)(0x4266E004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x4266E008UL))
#define bFM0P_GPIO_PZR0_P2                        *((volatile  uint8_t *)(0x4266E008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM0P_GPIO_PZR0_P3                        *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile  uint8_t *)(0x4266E010UL))
#define bFM0P_GPIO_PZR0_P4                        *((volatile  uint8_t *)(0x4266E010UL))
#define bFM_GPIO_PZR0_P7                          *((volatile  uint8_t *)(0x4266E01CUL))
#define bFM0P_GPIO_PZR0_P7                        *((volatile  uint8_t *)(0x4266E01CUL))
#define bFM_GPIO_PZR0_PA                          *((volatile  uint8_t *)(0x4266E028UL))
#define bFM0P_GPIO_PZR0_PA                        *((volatile  uint8_t *)(0x4266E028UL))
#define bFM_GPIO_PZR0_PB                          *((volatile  uint8_t *)(0x4266E02CUL))
#define bFM0P_GPIO_PZR0_PB                        *((volatile  uint8_t *)(0x4266E02CUL))
#define bFM_GPIO_PZR0_PC                          *((volatile  uint8_t *)(0x4266E030UL))
#define bFM0P_GPIO_PZR0_PC                        *((volatile  uint8_t *)(0x4266E030UL))
#define bFM_GPIO_PZR0_PD                          *((volatile  uint8_t *)(0x4266E034UL))
#define bFM0P_GPIO_PZR0_PD                        *((volatile  uint8_t *)(0x4266E034UL))
#define bFM_GPIO_PZR0_PE                          *((volatile  uint8_t *)(0x4266E038UL))
#define bFM0P_GPIO_PZR0_PE                        *((volatile  uint8_t *)(0x4266E038UL))
#define bFM_GPIO_PZR0_PF                          *((volatile  uint8_t *)(0x4266E03CUL))
#define bFM0P_GPIO_PZR0_PF                        *((volatile  uint8_t *)(0x4266E03CUL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x4266E080UL))
#define bFM0P_GPIO_PZR1_P0                        *((volatile  uint8_t *)(0x4266E080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x4266E084UL))
#define bFM0P_GPIO_PZR1_P1                        *((volatile  uint8_t *)(0x4266E084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x4266E088UL))
#define bFM0P_GPIO_PZR1_P2                        *((volatile  uint8_t *)(0x4266E088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM0P_GPIO_PZR1_P3                        *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM_GPIO_PZR1_P4                          *((volatile  uint8_t *)(0x4266E090UL))
#define bFM0P_GPIO_PZR1_P4                        *((volatile  uint8_t *)(0x4266E090UL))
#define bFM_GPIO_PZR1_P5                          *((volatile  uint8_t *)(0x4266E094UL))
#define bFM0P_GPIO_PZR1_P5                        *((volatile  uint8_t *)(0x4266E094UL))
#define bFM_GPIO_PZR1_P6                          *((volatile  uint8_t *)(0x4266E098UL))
#define bFM0P_GPIO_PZR1_P6                        *((volatile  uint8_t *)(0x4266E098UL))
#define bFM_GPIO_PZR1_P7                          *((volatile  uint8_t *)(0x4266E09CUL))
#define bFM0P_GPIO_PZR1_P7                        *((volatile  uint8_t *)(0x4266E09CUL))
#define bFM_GPIO_PZR1_P8                          *((volatile  uint8_t *)(0x4266E0A0UL))
#define bFM0P_GPIO_PZR1_P8                        *((volatile  uint8_t *)(0x4266E0A0UL))
#define bFM_GPIO_PZR1_P9                          *((volatile  uint8_t *)(0x4266E0A4UL))
#define bFM0P_GPIO_PZR1_P9                        *((volatile  uint8_t *)(0x4266E0A4UL))
#define bFM_GPIO_PZR1_PA                          *((volatile  uint8_t *)(0x4266E0A8UL))
#define bFM0P_GPIO_PZR1_PA                        *((volatile  uint8_t *)(0x4266E0A8UL))
#define bFM_GPIO_PZR1_PB                          *((volatile  uint8_t *)(0x4266E0ACUL))
#define bFM0P_GPIO_PZR1_PB                        *((volatile  uint8_t *)(0x4266E0ACUL))

#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x4266E104UL))
#define bFM0P_GPIO_PZR2_P1                        *((volatile  uint8_t *)(0x4266E104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x4266E108UL))
#define bFM0P_GPIO_PZR2_P2                        *((volatile  uint8_t *)(0x4266E108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x4266E10CUL))
#define bFM0P_GPIO_PZR2_P3                        *((volatile  uint8_t *)(0x4266E10CUL))

#define bFM_GPIO_PZR3_P0                          *((volatile  uint8_t *)(0x4266E180UL))
#define bFM0P_GPIO_PZR3_P0                        *((volatile  uint8_t *)(0x4266E180UL))
#define bFM_GPIO_PZR3_P1                          *((volatile  uint8_t *)(0x4266E184UL))
#define bFM0P_GPIO_PZR3_P1                        *((volatile  uint8_t *)(0x4266E184UL))
#define bFM_GPIO_PZR3_P2                          *((volatile  uint8_t *)(0x4266E188UL))
#define bFM0P_GPIO_PZR3_P2                        *((volatile  uint8_t *)(0x4266E188UL))
#define bFM_GPIO_PZR3_P3                          *((volatile  uint8_t *)(0x4266E18CUL))
#define bFM0P_GPIO_PZR3_P3                        *((volatile  uint8_t *)(0x4266E18CUL))
#define bFM_GPIO_PZR3_P9                          *((volatile  uint8_t *)(0x4266E1A4UL))
#define bFM0P_GPIO_PZR3_P9                        *((volatile  uint8_t *)(0x4266E1A4UL))
#define bFM_GPIO_PZR3_PA                          *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM0P_GPIO_PZR3_PA                        *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM_GPIO_PZR3_PB                          *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM0P_GPIO_PZR3_PB                        *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM_GPIO_PZR3_PC                          *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM0P_GPIO_PZR3_PC                        *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM_GPIO_PZR3_PD                          *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM0P_GPIO_PZR3_PD                        *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM_GPIO_PZR3_PE                          *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM0P_GPIO_PZR3_PE                        *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM_GPIO_PZR3_PF                          *((volatile  uint8_t *)(0x4266E1BCUL))
#define bFM0P_GPIO_PZR3_PF                        *((volatile  uint8_t *)(0x4266E1BCUL))

#define bFM_GPIO_PZR4_P4                          *((volatile  uint8_t *)(0x4266E210UL))
#define bFM0P_GPIO_PZR4_P4                        *((volatile  uint8_t *)(0x4266E210UL))
#define bFM_GPIO_PZR4_P5                          *((volatile  uint8_t *)(0x4266E214UL))
#define bFM0P_GPIO_PZR4_P5                        *((volatile  uint8_t *)(0x4266E214UL))
#define bFM_GPIO_PZR4_P6                          *((volatile  uint8_t *)(0x4266E218UL))
#define bFM0P_GPIO_PZR4_P6                        *((volatile  uint8_t *)(0x4266E218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile  uint8_t *)(0x4266E21CUL))
#define bFM0P_GPIO_PZR4_P7                        *((volatile  uint8_t *)(0x4266E21CUL))
#define bFM_GPIO_PZR4_P8                          *((volatile  uint8_t *)(0x4266E220UL))
#define bFM0P_GPIO_PZR4_P8                        *((volatile  uint8_t *)(0x4266E220UL))
#define bFM_GPIO_PZR4_P9                          *((volatile  uint8_t *)(0x4266E224UL))
#define bFM0P_GPIO_PZR4_P9                        *((volatile  uint8_t *)(0x4266E224UL))
#define bFM_GPIO_PZR4_PA                          *((volatile  uint8_t *)(0x4266E228UL))
#define bFM0P_GPIO_PZR4_PA                        *((volatile  uint8_t *)(0x4266E228UL))
#define bFM_GPIO_PZR4_PB                          *((volatile  uint8_t *)(0x4266E22CUL))
#define bFM0P_GPIO_PZR4_PB                        *((volatile  uint8_t *)(0x4266E22CUL))
#define bFM_GPIO_PZR4_PC                          *((volatile  uint8_t *)(0x4266E230UL))
#define bFM0P_GPIO_PZR4_PC                        *((volatile  uint8_t *)(0x4266E230UL))
#define bFM_GPIO_PZR4_PD                          *((volatile  uint8_t *)(0x4266E234UL))
#define bFM0P_GPIO_PZR4_PD                        *((volatile  uint8_t *)(0x4266E234UL))

#define bFM_GPIO_PZR5_P0                          *((volatile  uint8_t *)(0x4266E280UL))
#define bFM0P_GPIO_PZR5_P0                        *((volatile  uint8_t *)(0x4266E280UL))
#define bFM_GPIO_PZR5_P1                          *((volatile  uint8_t *)(0x4266E284UL))
#define bFM0P_GPIO_PZR5_P1                        *((volatile  uint8_t *)(0x4266E284UL))
#define bFM_GPIO_PZR5_P2                          *((volatile  uint8_t *)(0x4266E288UL))
#define bFM0P_GPIO_PZR5_P2                        *((volatile  uint8_t *)(0x4266E288UL))
#define bFM_GPIO_PZR5_P3                          *((volatile  uint8_t *)(0x4266E28CUL))
#define bFM0P_GPIO_PZR5_P3                        *((volatile  uint8_t *)(0x4266E28CUL))
#define bFM_GPIO_PZR5_P4                          *((volatile  uint8_t *)(0x4266E290UL))
#define bFM0P_GPIO_PZR5_P4                        *((volatile  uint8_t *)(0x4266E290UL))
#define bFM_GPIO_PZR5_P5                          *((volatile  uint8_t *)(0x4266E294UL))
#define bFM0P_GPIO_PZR5_P5                        *((volatile  uint8_t *)(0x4266E294UL))
#define bFM_GPIO_PZR5_P6                          *((volatile  uint8_t *)(0x4266E298UL))
#define bFM0P_GPIO_PZR5_P6                        *((volatile  uint8_t *)(0x4266E298UL))

