mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xe/common/s6e1b3xe.h
#define bFM_MFSI2S0_I2SST_CKSTP                   *((volatile  uint8_t *)(0x42794120UL))
#define bFM0P_MFSI2S0_I2SST_CKSTP                 *((volatile  uint8_t *)(0x42794120UL))
#define bFM_MFSI2S0_I2SST_BUSY                    *((volatile  uint8_t *)(0x42794124UL))
#define bFM0P_MFSI2S0_I2SST_BUSY                  *((volatile  uint8_t *)(0x42794124UL))


/*******************************************************************************
* MFSI2S Registers MFSI2S1
*   Bitband Section
*******************************************************************************/
#define bFM_MFSI2S1_CNTLREG_FRAML                 *((volatile  uint16_t*)(0x42795000UL))
#define bFM0P_MFSI2S1_CNTLREG_FRAML               *((volatile  uint16_t*)(0x42795000UL))
#define bFM_MFSI2S1_CNTLREG_I2SMOD                *((volatile  uint16_t*)(0x4279500CUL))
#define bFM0P_MFSI2S1_CNTLREG_I2SMOD              *((volatile  uint16_t*)(0x4279500CUL))
#define bFM_MFSI2S1_CNTLREG_FSPL                  *((volatile  uint16_t*)(0x42795010UL))
#define bFM0P_MFSI2S1_CNTLREG_FSPL                *((volatile  uint16_t*)(0x42795010UL))
#define bFM_MFSI2S1_CNTLREG_I2SEN                 *((volatile  uint16_t*)(0x42795014UL))
#define bFM0P_MFSI2S1_CNTLREG_I2SEN               *((volatile  uint16_t*)(0x42795014UL))
#define bFM_MFSI2S1_CNTLREG_CKOE                  *((volatile  uint16_t*)(0x42795018UL))
#define bFM0P_MFSI2S1_CNTLREG_CKOE                *((volatile  uint16_t*)(0x42795018UL))
#define bFM_MFSI2S1_CNTLREG_MSKB                  *((volatile  uint16_t*)(0x42795020UL))
#define bFM0P_MFSI2S1_CNTLREG_MSKB                *((volatile  uint16_t*)(0x42795020UL))
#define bFM_MFSI2S1_CNTLREG_I2SRUN                *((volatile  uint16_t*)(0x42795028UL))
#define bFM0P_MFSI2S1_CNTLREG_I2SRUN              *((volatile  uint16_t*)(0x42795028UL))

#define bFM_MFSI2S1_I2SCLK_MCKOE                  *((volatile  uint16_t*)(0x427950B8UL))
#define bFM0P_MFSI2S1_I2SCLK_MCKOE                *((volatile  uint16_t*)(0x427950B8UL))
#define bFM_MFSI2S1_I2SCLK_MCKIE                  *((volatile  uint16_t*)(0x427950BCUL))
#define bFM0P_MFSI2S1_I2SCLK_MCKIE                *((volatile  uint16_t*)(0x427950BCUL))

#define bFM_MFSI2S1_I2SST_CKSTP                   *((volatile  uint8_t *)(0x42795120UL))
#define bFM0P_MFSI2S1_I2SST_CKSTP                 *((volatile  uint8_t *)(0x42795120UL))
#define bFM_MFSI2S1_I2SST_BUSY                    *((volatile  uint8_t *)(0x42795124UL))
#define bFM0P_MFSI2S1_I2SST_BUSY                  *((volatile  uint8_t *)(0x42795124UL))


/*******************************************************************************
* MFT_PPG Registers MFT_PPG
*   Bitband Section
*******************************************************************************/
#define bFM_MFT_PPG_GATEC0_EDGE0                  *((volatile  uint8_t *)(0x42484300UL))
#define bFM0P_MFT_PPG_GATEC0_EDGE0                *((volatile  uint8_t *)(0x42484300UL))
#define bFM_MFT_PPG_GATEC0_STRG0                  *((volatile  uint8_t *)(0x42484304UL))
#define bFM0P_MFT_PPG_GATEC0_STRG0                *((volatile  uint8_t *)(0x42484304UL))
#define bFM_MFT_PPG_GATEC0_EDGE2                  *((volatile  uint8_t *)(0x42484310UL))
#define bFM0P_MFT_PPG_GATEC0_EDGE2                *((volatile  uint8_t *)(0x42484310UL))
#define bFM_MFT_PPG_GATEC0_STRG2                  *((volatile  uint8_t *)(0x42484314UL))
#define bFM0P_MFT_PPG_GATEC0_STRG2                *((volatile  uint8_t *)(0x42484314UL))

#define bFM_MFT_PPG_GATEC12_EDGE12                *((volatile  uint8_t *)(0x42485B00UL))
#define bFM0P_MFT_PPG_GATEC12_EDGE12              *((volatile  uint8_t *)(0x42485B00UL))
#define bFM_MFT_PPG_GATEC12_STRG12                *((volatile  uint8_t *)(0x42485B04UL))
#define bFM0P_MFT_PPG_GATEC12_STRG12              *((volatile  uint8_t *)(0x42485B04UL))
#define bFM_MFT_PPG_GATEC12_EDGE14                *((volatile  uint8_t *)(0x42485B10UL))
#define bFM0P_MFT_PPG_GATEC12_EDGE14              *((volatile  uint8_t *)(0x42485B10UL))
#define bFM_MFT_PPG_GATEC12_STRG14                *((volatile  uint8_t *)(0x42485B14UL))
#define bFM0P_MFT_PPG_GATEC12_STRG14              *((volatile  uint8_t *)(0x42485B14UL))

#define bFM_MFT_PPG_GATEC16_EDGE16                *((volatile  uint8_t *)(0x42486300UL))
#define bFM0P_MFT_PPG_GATEC16_EDGE16              *((volatile  uint8_t *)(0x42486300UL))
#define bFM_MFT_PPG_GATEC16_STRG16                *((volatile  uint8_t *)(0x42486304UL))
#define bFM0P_MFT_PPG_GATEC16_STRG16              *((volatile  uint8_t *)(0x42486304UL))
#define bFM_MFT_PPG_GATEC16_EDGE18                *((volatile  uint8_t *)(0x42486310UL))
#define bFM0P_MFT_PPG_GATEC16_EDGE18              *((volatile  uint8_t *)(0x42486310UL))
#define bFM_MFT_PPG_GATEC16_STRG18                *((volatile  uint8_t *)(0x42486314UL))
#define bFM0P_MFT_PPG_GATEC16_STRG18              *((volatile  uint8_t *)(0x42486314UL))

#define bFM_MFT_PPG_GATEC20_EDGE20                *((volatile  uint8_t *)(0x42486B00UL))
#define bFM0P_MFT_PPG_GATEC20_EDGE20              *((volatile  uint8_t *)(0x42486B00UL))
#define bFM_MFT_PPG_GATEC20_STRG20                *((volatile  uint8_t *)(0x42486B04UL))
#define bFM0P_MFT_PPG_GATEC20_STRG20              *((volatile  uint8_t *)(0x42486B04UL))
#define bFM_MFT_PPG_GATEC20_EDGE22                *((volatile  uint8_t *)(0x42486B10UL))
#define bFM0P_MFT_PPG_GATEC20_EDGE22              *((volatile  uint8_t *)(0x42486B10UL))
#define bFM_MFT_PPG_GATEC20_STRG22                *((volatile  uint8_t *)(0x42486B14UL))
#define bFM0P_MFT_PPG_GATEC20_STRG22              *((volatile  uint8_t *)(0x42486B14UL))

#define bFM_MFT_PPG_GATEC4_EDGE4                  *((volatile  uint8_t *)(0x42484B00UL))
#define bFM0P_MFT_PPG_GATEC4_EDGE4                *((volatile  uint8_t *)(0x42484B00UL))
#define bFM_MFT_PPG_GATEC4_STRG4                  *((volatile  uint8_t *)(0x42484B04UL))
#define bFM0P_MFT_PPG_GATEC4_STRG4                *((volatile  uint8_t *)(0x42484B04UL))
#define bFM_MFT_PPG_GATEC4_EDGE6                  *((volatile  uint8_t *)(0x42484B10UL))
#define bFM0P_MFT_PPG_GATEC4_EDGE6                *((volatile  uint8_t *)(0x42484B10UL))
#define bFM_MFT_PPG_GATEC4_STRG6                  *((volatile  uint8_t *)(0x42484B14UL))
#define bFM0P_MFT_PPG_GATEC4_STRG6                *((volatile  uint8_t *)(0x42484B14UL))

#define bFM_MFT_PPG_GATEC8_EDGE8                  *((volatile  uint8_t *)(0x42485300UL))
#define bFM0P_MFT_PPG_GATEC8_EDGE8                *((volatile  uint8_t *)(0x42485300UL))
#define bFM_MFT_PPG_GATEC8_STRG8                  *((volatile  uint8_t *)(0x42485304UL))
#define bFM0P_MFT_PPG_GATEC8_STRG8                *((volatile  uint8_t *)(0x42485304UL))
#define bFM_MFT_PPG_GATEC8_EDGE10                 *((volatile  uint8_t *)(0x42485310UL))
#define bFM0P_MFT_PPG_GATEC8_EDGE10               *((volatile  uint8_t *)(0x42485310UL))
#define bFM_MFT_PPG_GATEC8_STRG10                 *((volatile  uint8_t *)(0x42485314UL))
#define bFM0P_MFT_PPG_GATEC8_STRG10               *((volatile  uint8_t *)(0x42485314UL))

#define bFM_MFT_PPG_IGBTC_IGBTMD                  *((volatile  uint8_t *)(0x42487000UL))
#define bFM0P_MFT_PPG_IGBTC_IGBTMD                *((volatile  uint8_t *)(0x42487000UL))
#define bFM_MFT_PPG_IGBTC_IGTRGLV                 *((volatile  uint8_t *)(0x42487004UL))
#define bFM0P_MFT_PPG_IGBTC_IGTRGLV               *((volatile  uint8_t *)(0x42487004UL))
#define bFM_MFT_PPG_IGBTC_IGATIH                  *((volatile  uint8_t *)(0x4248701CUL))
#define bFM0P_MFT_PPG_IGBTC_IGATIH                *((volatile  uint8_t *)(0x4248701CUL))

