mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xe/common/s6e1b3xe.h
/*******************************************************************************
* SMCIF Registers SMCIF0
*   Bitband Section
*******************************************************************************/
#define bFM_SMCIF0_BAUDRATE_LITTLESTEP            *((volatile  uint16_t*)(0x427922BCUL))
#define bFM0P_SMCIF0_BAUDRATE_LITTLESTEP          *((volatile  uint16_t*)(0x427922BCUL))

#define bFM_SMCIF0_FIFO_CLEAR_MSB_READ_CLRRDFIFO  *((volatile  uint16_t*)(0x42792700UL))
#define bFM0P_SMCIF0_FIFO_CLEAR_MSB_READ_CLRRDFIFO *((volatile  uint16_t*)(0x42792700UL))

#define bFM_SMCIF0_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42792680UL))
#define bFM0P_SMCIF0_FIFO_CLEAR_MSB_WRITE_CLRWRFIFO *((volatile  uint16_t*)(0x42792680UL))

#define bFM_SMCIF0_FIFO_MODE_FIFOEN               *((volatile  uint16_t*)(0x42792600UL))
#define bFM0P_SMCIF0_FIFO_MODE_FIFOEN             *((volatile  uint16_t*)(0x42792600UL))
#define bFM_SMCIF0_FIFO_MODE_RDFIFOOVRIRQEN       *((volatile  uint16_t*)(0x42792604UL))
#define bFM0P_SMCIF0_FIFO_MODE_RDFIFOOVRIRQEN     *((volatile  uint16_t*)(0x42792604UL))
#define bFM_SMCIF0_FIFO_MODE_WRFIFOIRQEN          *((volatile  uint16_t*)(0x42792608UL))
#define bFM0P_SMCIF0_FIFO_MODE_WRFIFOIRQEN        *((volatile  uint16_t*)(0x42792608UL))
#define bFM_SMCIF0_FIFO_MODE_RDFIFOIRQEN          *((volatile  uint16_t*)(0x4279260CUL))
#define bFM0P_SMCIF0_FIFO_MODE_RDFIFOIRQEN        *((volatile  uint16_t*)(0x4279260CUL))

#define bFM_SMCIF0_GLOBALCONTROL1_PARITY          *((volatile  uint16_t*)(0x42792000UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_PARITY        *((volatile  uint16_t*)(0x42792000UL))
#define bFM_SMCIF0_GLOBALCONTROL1_FRM0            *((volatile  uint16_t*)(0x42792004UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_FRM0          *((volatile  uint16_t*)(0x42792004UL))
#define bFM_SMCIF0_GLOBALCONTROL1_FRM1            *((volatile  uint16_t*)(0x42792008UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_FRM1          *((volatile  uint16_t*)(0x42792008UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MODE8N1         *((volatile  uint16_t*)(0x4279200CUL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_MODE8N1       *((volatile  uint16_t*)(0x4279200CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKRXFUL       *((volatile  uint16_t*)(0x42792010UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_MASKRXFUL     *((volatile  uint16_t*)(0x42792010UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKTXEMP       *((volatile  uint16_t*)(0x42792014UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_MASKTXEMP     *((volatile  uint16_t*)(0x42792014UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKSTI         *((volatile  uint16_t*)(0x42792018UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_MASKSTI       *((volatile  uint16_t*)(0x42792018UL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKCAEVENT     *((volatile  uint16_t*)(0x4279201CUL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_MASKCAEVENT   *((volatile  uint16_t*)(0x4279201CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_MASKITEXP       *((volatile  uint16_t*)(0x42792020UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_MASKITEXP     *((volatile  uint16_t*)(0x42792020UL))
#define bFM_SMCIF0_GLOBALCONTROL1_IOMOD           *((volatile  uint16_t*)(0x42792024UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_IOMOD         *((volatile  uint16_t*)(0x42792024UL))
#define bFM_SMCIF0_GLOBALCONTROL1_CKMOD           *((volatile  uint16_t*)(0x42792028UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_CKMOD         *((volatile  uint16_t*)(0x42792028UL))
#define bFM_SMCIF0_GLOBALCONTROL1_RESND           *((volatile  uint16_t*)(0x4279202CUL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_RESND         *((volatile  uint16_t*)(0x4279202CUL))
#define bFM_SMCIF0_GLOBALCONTROL1_GUAEN           *((volatile  uint16_t*)(0x42792030UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_GUAEN         *((volatile  uint16_t*)(0x42792030UL))
#define bFM_SMCIF0_GLOBALCONTROL1_STIDT           *((volatile  uint16_t*)(0x42792034UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_STIDT         *((volatile  uint16_t*)(0x42792034UL))
#define bFM_SMCIF0_GLOBALCONTROL1_IDTSC           *((volatile  uint16_t*)(0x42792038UL))
#define bFM0P_SMCIF0_GLOBALCONTROL1_IDTSC         *((volatile  uint16_t*)(0x42792038UL))

#define bFM_SMCIF0_GLOBALCONTROL2_RX8N1           *((volatile  uint16_t*)(0x42792400UL))
#define bFM0P_SMCIF0_GLOBALCONTROL2_RX8N1         *((volatile  uint16_t*)(0x42792400UL))
#define bFM_SMCIF0_GLOBALCONTROL2_INVDATAOUT      *((volatile  uint16_t*)(0x42792404UL))
#define bFM0P_SMCIF0_GLOBALCONTROL2_INVDATAOUT    *((volatile  uint16_t*)(0x42792404UL))
#define bFM_SMCIF0_GLOBALCONTROL2_ICCDISABLE      *((volatile  uint16_t*)(0x4279240CUL))
#define bFM0P_SMCIF0_GLOBALCONTROL2_ICCDISABLE    *((volatile  uint16_t*)(0x4279240CUL))

#define bFM_SMCIF0_IRQ_STATUS_RDFIFOOVRIRQ        *((volatile  uint16_t*)(0x42792800UL))
#define bFM0P_SMCIF0_IRQ_STATUS_RDFIFOOVRIRQ      *((volatile  uint16_t*)(0x42792800UL))
#define bFM_SMCIF0_IRQ_STATUS_WRFIFOIRQ           *((volatile  uint16_t*)(0x42792804UL))
#define bFM0P_SMCIF0_IRQ_STATUS_WRFIFOIRQ         *((volatile  uint16_t*)(0x42792804UL))
#define bFM_SMCIF0_IRQ_STATUS_RDFIFOIRQ           *((volatile  uint16_t*)(0x42792808UL))
#define bFM0P_SMCIF0_IRQ_STATUS_RDFIFOIRQ         *((volatile  uint16_t*)(0x42792808UL))
#define bFM_SMCIF0_IRQ_STATUS_IDTEXPIRQ           *((volatile  uint16_t*)(0x4279280CUL))
#define bFM0P_SMCIF0_IRQ_STATUS_IDTEXPIRQ         *((volatile  uint16_t*)(0x4279280CUL))
#define bFM_SMCIF0_IRQ_STATUS_CARDEVENTIRQ        *((volatile  uint16_t*)(0x42792810UL))
#define bFM0P_SMCIF0_IRQ_STATUS_CARDEVENTIRQ      *((volatile  uint16_t*)(0x42792810UL))
#define bFM_SMCIF0_IRQ_STATUS_RXSTBIIRQ           *((volatile  uint16_t*)(0x42792814UL))
#define bFM0P_SMCIF0_IRQ_STATUS_RXSTBIIRQ         *((volatile  uint16_t*)(0x42792814UL))
#define bFM_SMCIF0_IRQ_STATUS_TXEMPIRQ            *((volatile  uint16_t*)(0x42792818UL))
#define bFM0P_SMCIF0_IRQ_STATUS_TXEMPIRQ          *((volatile  uint16_t*)(0x42792818UL))
#define bFM_SMCIF0_IRQ_STATUS_RXFULIRQ            *((volatile  uint16_t*)(0x4279281CUL))
#define bFM0P_SMCIF0_IRQ_STATUS_RXFULIRQ          *((volatile  uint16_t*)(0x4279281CUL))

#define bFM_SMCIF0_PORTCONTROL_TRIMOD             *((volatile  uint16_t*)(0x42792100UL))
#define bFM0P_SMCIF0_PORTCONTROL_TRIMOD           *((volatile  uint16_t*)(0x42792100UL))
#define bFM_SMCIF0_PORTCONTROL_IO1                *((volatile  uint16_t*)(0x42792108UL))
#define bFM0P_SMCIF0_PORTCONTROL_IO1              *((volatile  uint16_t*)(0x42792108UL))
#define bFM_SMCIF0_PORTCONTROL_IO1EN              *((volatile  uint16_t*)(0x42792110UL))
#define bFM0P_SMCIF0_PORTCONTROL_IO1EN            *((volatile  uint16_t*)(0x42792110UL))
#define bFM_SMCIF0_PORTCONTROL_CLKPT              *((volatile  uint16_t*)(0x42792118UL))
#define bFM0P_SMCIF0_PORTCONTROL_CLKPT            *((volatile  uint16_t*)(0x42792118UL))
#define bFM_SMCIF0_PORTCONTROL_RST                *((volatile  uint16_t*)(0x4279211CUL))
#define bFM0P_SMCIF0_PORTCONTROL_RST              *((volatile  uint16_t*)(0x4279211CUL))
#define bFM_SMCIF0_PORTCONTROL_VCCEN              *((volatile  uint16_t*)(0x42792120UL))
#define bFM0P_SMCIF0_PORTCONTROL_VCCEN            *((volatile  uint16_t*)(0x42792120UL))
#define bFM_SMCIF0_PORTCONTROL_VPEN               *((volatile  uint16_t*)(0x42792124UL))
#define bFM0P_SMCIF0_PORTCONTROL_VPEN             *((volatile  uint16_t*)(0x42792124UL))
#define bFM_SMCIF0_PORTCONTROL_CLKOUTEN           *((volatile  uint16_t*)(0x42792130UL))
#define bFM0P_SMCIF0_PORTCONTROL_CLKOUTEN         *((volatile  uint16_t*)(0x42792130UL))
#define bFM_SMCIF0_PORTCONTROL_RSTOUTEN           *((volatile  uint16_t*)(0x42792134UL))
#define bFM0P_SMCIF0_PORTCONTROL_RSTOUTEN         *((volatile  uint16_t*)(0x42792134UL))
#define bFM_SMCIF0_PORTCONTROL_VCCOUTEN           *((volatile  uint16_t*)(0x42792138UL))
#define bFM0P_SMCIF0_PORTCONTROL_VCCOUTEN         *((volatile  uint16_t*)(0x42792138UL))
#define bFM_SMCIF0_PORTCONTROL_VPENOUTEN          *((volatile  uint16_t*)(0x4279213CUL))
#define bFM0P_SMCIF0_PORTCONTROL_VPENOUTEN        *((volatile  uint16_t*)(0x4279213CUL))

#define bFM_SMCIF0_STATUS_TXEMP                   *((volatile  uint16_t*)(0x42792080UL))
#define bFM0P_SMCIF0_STATUS_TXEMP                 *((volatile  uint16_t*)(0x42792080UL))
#define bFM_SMCIF0_STATUS_RXFUL                   *((volatile  uint16_t*)(0x42792084UL))
#define bFM0P_SMCIF0_STATUS_RXFUL                 *((volatile  uint16_t*)(0x42792084UL))
#define bFM_SMCIF0_STATUS_RXACT                   *((volatile  uint16_t*)(0x42792088UL))
#define bFM0P_SMCIF0_STATUS_RXACT                 *((volatile  uint16_t*)(0x42792088UL))
#define bFM_SMCIF0_STATUS_TXACT                   *((volatile  uint16_t*)(0x4279208CUL))
#define bFM0P_SMCIF0_STATUS_TXACT                 *((volatile  uint16_t*)(0x4279208CUL))
#define bFM_SMCIF0_STATUS_CARDDETECT              *((volatile  uint16_t*)(0x42792090UL))
#define bFM0P_SMCIF0_STATUS_CARDDETECT            *((volatile  uint16_t*)(0x42792090UL))
#define bFM_SMCIF0_STATUS_CARDEVENT               *((volatile  uint16_t*)(0x42792094UL))
#define bFM0P_SMCIF0_STATUS_CARDEVENT             *((volatile  uint16_t*)(0x42792094UL))
#define bFM_SMCIF0_STATUS_RECOFL                  *((volatile  uint16_t*)(0x42792098UL))
#define bFM0P_SMCIF0_STATUS_RECOFL                *((volatile  uint16_t*)(0x42792098UL))
#define bFM_SMCIF0_STATUS_IDTRUN                  *((volatile  uint16_t*)(0x4279209CUL))
#define bFM0P_SMCIF0_STATUS_IDTRUN                *((volatile  uint16_t*)(0x4279209CUL))
#define bFM_SMCIF0_STATUS_RDFIFOOVR               *((volatile  uint16_t*)(0x427920A0UL))
#define bFM0P_SMCIF0_STATUS_RDFIFOOVR             *((volatile  uint16_t*)(0x427920A0UL))
#define bFM_SMCIF0_STATUS_RDFIFOFUL               *((volatile  uint16_t*)(0x427920A4UL))
#define bFM0P_SMCIF0_STATUS_RDFIFOFUL             *((volatile  uint16_t*)(0x427920A4UL))
#define bFM_SMCIF0_STATUS_WRFIFOEMP               *((volatile  uint16_t*)(0x427920A8UL))
#define bFM0P_SMCIF0_STATUS_WRFIFOEMP             *((volatile  uint16_t*)(0x427920A8UL))
#define bFM_SMCIF0_STATUS_RXSTARTERR              *((volatile  uint16_t*)(0x427920ACUL))
#define bFM0P_SMCIF0_STATUS_RXSTARTERR            *((volatile  uint16_t*)(0x427920ACUL))
#define bFM_SMCIF0_STATUS_TXRESEND                *((volatile  uint16_t*)(0x427920B0UL))
#define bFM0P_SMCIF0_STATUS_TXRESEND              *((volatile  uint16_t*)(0x427920B0UL))
#define bFM_SMCIF0_STATUS_RXRESEND                *((volatile  uint16_t*)(0x427920B4UL))
#define bFM0P_SMCIF0_STATUS_RXRESEND              *((volatile  uint16_t*)(0x427920B4UL))


